var data = [
	{
		guaName:"乾为天",yinYang:[1,1,1,1,1,1],
		guaCi:"【原文】乾①。元亨、利贞②。<br>【译文】乾卦：大吉大利，吉利的贞卜。<br>【注释】①乾，卦名。 《周易》以卦为单位，全书共六十四卦。每卦有四个组成部分。即卦画、卦名、卦辞、爻辞。易卦的结构分为三个层次，最小的单位是爻，基本单位是经卦，每卦由二个经卦，或者说由六爻组成。经卦有八个，即乾，坤、坎、离、巽、震、艮、兑。它们分别代表八种类别的自然物质，如乾代表天文之事，坤代表地理之事，卦象是比较单纯的。八个经卦互相重迭构成六十四卦。经卦两两相重就产生了具有内部关系的复合卦象。根据八个经卦所代表事物的物理属性，从而形成了相制相克、相和相应的一系列矛盾，用以象征性地概括表示自然、社会的种种现象。卦辞、爻辞，以及《彖》、《象》，即是从不同角度对这些矛盾进行解说，从而判定物象人事的凶吉。组成各卦的两个经卦，又依其位置称为上卦与下卦。上卦又称为外卦，下卦又称为内卦。这种位置区分与卦象、爻位联系起来，也是分析卦、爻意义的重要的结构关系。本卦是同卦相叠(乾下乾上)。六画都是阳爻(阳爻，参见本卦初九爻题注)，用以象天，喻龙，比喻有才德的君子。后人说《易》多附会，将其象征意义广泛推衍，用以代表纯阳刚健的事物，以及与此相关联的人伦义理概念(可详《说卦》各篇)。<br>②元亨、利贞，是两个贞兆辞。《易卦》的卦、爻之辞可以从很多角度上进行分析。大概可归纳为三种类型：一是贞事辞，它记录着占筮的具体事情；二是贞兆辞，它指占筮时神灵感应的兆示，如吉、凶之类；三是象占辞，它记录着日常生活中一些异常现象，比如说梦境中的现象，用以向神灵卜问其吉凶。元，大。亨，通。利贞，《说文》：“贞，卜问也。”利贞，犹言吉利的贞卜。<br><br>【原文】《彖》曰①：大哉乾元②，万物资始③，乃统④天。云行雨施，品物流形⑤。态呀终笔⑥，六位时成，时乘六龙以御天⑦。乾道变化，各正性命。保合大和，乃利贞⑧。首出庶物，万国咸宁⑨。<br>【译文】《彖辞》说：伟大啊，上天的开创之功。万物依赖它获得生命的胚胎，它们统统属于上天。云在飘行，雨在降洒，繁殖万物，赋予形体。太阳运行，升上降下，出东没西，向南朝北，六方位置，依太阳的轨迹而得以确定。太阳驾驶着六条飞龙在空中有规律的运行。这种运行变化，形成季节气候，万物从而在大自然中找到适合生存的地位。天的运行，保持、调整着全面和谐的关系，于是达到普利万物，正常循环的境界。天的功德超出万种物类，给万国带来普遍的康宁。<br>【注释】①彖(tuan团去声)，《周易正义》：“彖，断也，断定一卦之义，所以名为彖也。”古人以《彖》上下、《象》上下、《系辞》上下凡六篇和《文言》、《说卦》、《序卦》、《杂卦》凡四篇，合称十翼。用十翼以释经，故又称《易传》。<br>②乾，天。元，始，犹言创始。<br>③资，凭借，依赖。<br>④统。统率。统天，犹言统属于天。<br>⑤品，品类。这里用如动词，有繁殖义。品物，繁殖万物。流，这里引申为赋予。流形，赋予形体。<br>⑥大明，高亨说：“《集解》引侯果曰：‘大明，日也。’甚是。终，谓日入；始，谓日出。”<br>⑦御，《集解》引苟爽曰：御者，行也。”上古神话，日乘着六条飞龙拉着的车子，以羲和为御，运行在天空。<br>⑧保，保持。合，调整。大和，大读为太。太和，指自然界的一种普遍调顺谐和的关系。利，施利。贞，中正。《彖》、《象》释贞多用此意，与经意有出入。<br>⑨庶，众。庶物，犹言万物。首出庶物，当指天的功德超出万种物类。咸，皆，周遍。<br><br>【原文】《象》曰①：天行健，君子以自强不息②。<br>【译文】《象辞》说：天道刚健，运行不已。君子观此卦象，从而以天为法，自强不息。<br>【注释】①象，《易?乾》疏：“圣人设卦以写万物之象。后人用文字以释万物之所象，故曰象。”《象》，易传名，十翼之一。它主要是依据卦象、爻位对卦辞、爻辞进行解释，评价，推衍。其内容贯穿着儒家政治伦理思想。②行，王引之说：“行，道也。天行谓天道也。”君子，指德才兼备的人。《象辞》释卦辞，通常将卦象所表示的自然现象与人的品德行为勉强地联系起来加以阐发。",
		yaoCi:[
		"【原文】初九①：潜龙勿用②。<br>《象》曰：潜龙勿用，阳在下也。<br>【译文】初九：潜藏的龙，无法施展。<br>《象辞》说：潜藏的龙，无法施展，因为初九阳爻处在一卦的下位，所以压抑难伸。<br>【注释】①初九：爻题。易卦的爻题，以“九”标示阳爻，以“六”标示阴爻。又以初、二、三、四、五、上标示从下至上各爻的顺序。就各爻在全卦中的关系而言，初、三、五为阳位，二、四、上为阴位；而二、五又分为下卦与上卦的中位，初、四分为下卦与上卦的下位，三、上分为下卦与上卦的上位。《文言》还将二看作地位，五看作天位，三看作人位。阴爻、阳爻在这些位置上的分布构成了一定的爻位关系。爻位关系是分析各爻意义的一种重要依据(详见各爻分析)。<br>②潜龙勿用，比喻君子压抑予下层，不能有所作为。",
		"【原文】九二：见龙在田，利见大人①。<br>《象》曰：见龙在田，德普施也。<br>【译文】九二：龙出现在大地上，有利于会见贵族王公。<br>《象辞》说：龙出现在大地上，喻指君子走出了压抑的低谷，正开始谋取能够广泛施予德泽的社会地位。<br>【注释】①见，读若现，出现。见龙，系“龙见”的倒装，犹言龙出现。在田，犹言出现在大地上。王弼说。‘出潜离隐，故曰‘见龙’，处于地上，故曰‘在田’。德施周普，居中不偏，虽非君位，君之德也。初则不彰。三则乾乾，四则或跃，上则过亢。利见大人，唯二五焉。”王弼对于《乾》卦整体结构的解说颇为有理。本卦阳爻，由初爻而升到上位，爻辞以龙在地下，人间，天空各个层次的变化来比拟这一爻象，从而附会出人在人生的不同际遇中的自我作用和命运。见龙在田，爻辞以龙出潜在田，表示初九阳爻升进一步，居于下卦中位。此位象极佳，比喻君子挣脱了压抑的处境，开始步予社会生活，创造建功立业的条件。",
		"【原文】九三：君子终日乾乾①，夕惕若，厉，无咎②。<br>《象》日：终日乾乾，反复道也。<br>【译文】九三：有才德的君子始终是白天勤奋努力，夜晚戒惧反省，虽然处境艰难，但终究没有灾难。<br>《象辞》说：君子整日里勤奋努力，意思是反复行道，坚持不舍。<br>【注释】①乾乾，勤奋努力。<br>②惕，警惕。若，助词，无义。厉，危险。无咎，没有灾难。本爻为阳位，居下卦之极。根据《系辞》“三与五，同功而异位，三多凶，五多功”的理论，可见本卦九三之爻，象征着君子处于既可大有作为而又充满凶险的处境之中，如能倍加勤勉戒惧，可以没有灾难。",
		"【原文】九四：或跃在渊，无咎①。<br>《象》曰：或跃在渊，进无咎也。<br>【译文】九四：龙也许跳进深潭，没有灾难。<br>《象辞》说：龙也许跳进深潭，表示可以有所作为而没有灾难。<br>【注释】①或跃在渊，九四阳爻居上卦下位，根据《系辞》“二与四，同功而异位，其善不同。二多誉，四多惧”的理论，可见本卦九四之爻，象征着处于进可取誉，退可免难的转折时期。爻辞以龙跃深渊为喻，龙跃入深潭，退可藏身于千仞之下，进可升腾于云天之外，进退有据，潜跃由心，喻指君子处境从容，故无灾难。",
		"【原文】九五：飞龙在天，利见大人①。<br>《象》曰：飞龙在天，大人造也②。<br>【译文】九五：龙飞腾在空中，有利于会见贵族王公。<br>《象辞》说：龙飞腾在空中，意味着君子大有所为。<br>【注释】①飞龙在天，喻君子处尊贵之位。<br>②造，朱熹说：“造，犹作也。”大人造，犹言，(九五爻象表明)尊贵的君子大有所为，大有造化。九五之爻，居阳位，又处于上卦中位，可谓性象相合，所处得当，喻指君子处世得意，其事业如日中天。",
		"【原文】上九：亢龙有悔①。<br>《象》曰：亢龙有悔，盈不可久也。<br>【译文】上九：升腾到极限的龙会有灾祸之困。<br>《象辞》说：升腾到极限的龙会有灾祸之困，这是警戒人们崇高、盈满是不可能长久保持的。<br>【注释】①亢，王肃说：“穷高曰亢。”子夏《传》：“亢，极也。”悔，《系辞》：“悔吝者，忧虞之象也。”亢龙有悔，以升腾到极高处的龙，喻指身居崇高地位的统治者，脱离臣民，孤高无辅，必遭灾祸。因为上九之爻，居全卦之尽头，在本卦系统中，乃是孤立无援之象。",
		"【原文】用九①：见群龙无首，吉。<br>《象》曰：用九天德，不可为首也。<br>【译文】群龙出现在天空，看不出首领，吉利。<br>《象辞》说：六爻全阳，纯阳纯刚正是天道之性，至高无上，不可能再有别的首领。<br>【注释】①用九，《乾》卦特有的爻题。汉帛书《周易》作“迥九”。迥，通。用九即为通九，犹言六爻皆九。属阳性，表示全阳爻将尽变为阴爻。<br>②用九天德，因《乾》卦六爻皆为九，属纯阳纯刚之性，这正是天的品德的最为集中的反映。"
		]
	},
	{
		guaName:"坤为地",yinYang:[0,0,0,0,0,0],
		guaCi:"",
		yaoCi:[
		"",
		"",
		"",
		"",
		"",
		""
		]
	}

]